cask_args appdir: '/Applications'

tap 'teamookla/speedtest'

#programming
brew 'uv'
brew 'node'
brew 'coreutils'
brew 'openssl@3'
brew 'readline'
brew 'mas' # for brew to install app store apps
brew 'wget'
brew 'ffmpeg'
brew 'grep'
brew 'watch'
brew 'lazygit'
brew 'fzf'
brew 'tree'
brew 'pre-commit'
brew 'asitop'
brew 'rsync'

#shell
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'htop'
brew 'fastfetch'
brew 'tmux'
brew 'vim'
brew 'speedtest'

# programs
cask 'tailscale-app'
cask 'brave-browser'
cask 'docker'
cask 'visual-studio-code'
cask 'appcleaner'
cask 'jordanbaird-ice'
cask 'discord'
cask 'slack'
cask 'notion'
cask 'microsoft-teams'
cask 'microsoft-outlook'
cask 'utm' # virtual machine emulator
cask 'parsec'
cask 'iina'
cask 'pdf-squeezer'
cask 'sensiblesidebuttons'
cask 'scroll-reverser'
cask 'unifi-identity-endpoint'
cask 'microsoft-outlook'
cask 'wireshark-app'

#fonts
cask 'font-jetbrains-mono'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font' # nerd font for terminal icons
cask 'font-hack-nerd-font'


mas "Magnet", id: 441258766
mas "Dark Reader", id: 1438243180
mas "1blocker", id: 1365531024
