cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'teamookla/speedtest'

#programming
# brew 'python' # comes with macos
brew 'node'
brew 'coreutils'
brew 'openssl'
brew 'readline'
brew 'mas' # for brew to install app store apps
brew 'wget'
brew 'ffmpeg'
brew 'grep'
brew 'watch'

#shell
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'htop'
brew 'fastfetch'
brew 'tmux'
brew 'vim'
brew 'speedtest'

# programs
cask 'brave-browser'
cask 'docker'
cask 'visual-studio-code'
cask 'appcleaner'
cask 'dozer'
cask 'discord'
cask 'notion'
cask 'microsoft-teams'
cask 'microsoft-outlook'
cask 'microsoft-azure-storage-explorer'
cask 'utm' # virtual machine emulator
cask 'parsec'
cask 'iina'
cask 'pdf-squeezer'
cask 'sensiblesidebuttons'
cask 'scroll-reverser'

#fonts
cask 'font-jetbrains-mono'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font' # nerd font for terminal icons
cask 'font-hack-nerd-font'


mas "Magnet", id: 441258766
mas "Dark Reader", id: 1438243180
mas "1blocker", id: 1365531024
mas "Microsoft Outlook", id: 985367838
mas "Slack", id: 803453959
