cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

#programming
# brew 'python' # comes with macos
brew 'node'
brew 'coreutils'
brew 'openssl'
brew 'readline'
brew 'mas' # for brew to install app store apps
brew 'wget'
brew 'ffmpeg'


#shell
# brew 'zsh' # comes with macos
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'htop'
brew 'neofetch'
brew 'tmux'
brew 'vim'

# programs
cask 'google-chrome'
cask 'docker'
cask 'visual-studio-code'
cask 'appcleaner'
cask 'dozer'
cask 'discord'
cask 'notion'
cask 'microsoft-teams'
cask 'microsoft-outlook'
cask 'microsoft-azure-storage-explorer'
# cask 'parallels'
cask 'utm' # free alternative to parallels
cask 'parsec'
cask 'iina'

#fonts
cask 'font-jetbrains-mono'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font' # nerd font for terminal icons
cask 'font-hack-nerd-font'


mas "Magnet", id: 441258766
mas "Dark Reader", id: 1438243180
mas "1blocker", id: 1365531024
mas "Microsoft Outlook", id: 985367838
